Repository: crummel/source-build-tarball-2.0.5
Catalog: src/vstest/src/Microsoft.TestPlatform.Common/Resources/xlf/Resources.*.xlf
Languages: es

# DataCollectionMessageFormat
source: Data collection : {0}
es: Recopilación de datos: {0}

# DataCollectorMessageFormat
source: Data collector '{0}' message: {1}.
es: Mensaje del recopilador de datos "{0}": {1}.

# DuplicateExtensionUri
source: Duplicate test extension URI '{0}'. Ignoring the duplicate extension.
es: URI de extensión de pruebas duplicado ({0}). Se omitirá la extensión duplicada.

# DuplicateSettingsName
source: Duplicate settings provider named '{0}'. Ignoring the duplicate provider.
es: Proveedor de configuración duplicado con el nombre '{0}'. Se omitirá el proveedor duplicado.

# EmptyParenthesis
source: Error: Empty parenthesis ( )
es: Error: Paréntesis vacío ( )

# InvalidCondition
source: Error: Invalid Condition '{0}'
es: Error: Condición '{0}' no válida

# InvalidExtensionUriFormat
source: Test Extension has an invalid URI '{0}': {1}
es: La extensión de pruebas tiene un URI no válido ({0}): {1}

# InvalidOperator
source: Error: Invalid operator '{0}'
es: Error: Operador no válido ({0})

# LoggerInitializationError
source: Exception occurred while initializing logger with URI '{0}'. The logger will not be used. Exception: {1}
es: Se produjo una excepción al inicializar el registrador con el URI '{0}'. No se usará el registrador. Excepción: {1}

# LoggerNotFound
source: Could not find a test logger with URI or FriendlyName '{0}'.
es: No se encuentra un registrador de pruebas con el URI o el nombre descriptivo '{0}'.

# MissingCloseParenthesis
source: Error: Missing ')'
es: Error: Falta ')'

# MissingOpenParenthesis
source: Error: Missing '('
es: Error: Falta '('

# MissingOperand
source: Error: Missing operand
es: Error: Falta un operando

# MissingOperator
source: Missing Operator '|' or '&'
es: Falta el operador '|' o '&'

# RunSettingsAlreadyLoaded
source: The Run Settings have already been loaded.
es: Los parámetros de ejecución ya se han cargado.

# RunSettingsParseError
source: An error occurred while loading the run settings. Error: {0}
es: Error al cargar los parámetros de ejecución. Error: {0}

# SettingsNodeInvalidName
source: Invalid settings node specified. The name property of the settings node must be non-empty.
es: Se especificó un nodo de configuración no válido. La propiedad de nombre del nodo de configuración no debe estar vacía.

# SettingsProviderInitializationError
source: An error occurred while initializing the settings provider named '{0}'. Error: {1}
es: Error al inicializar el proveedor de configuración '{0}'. Error: {1}

# SettingsProviderNotFound
source: Settings Provider named '{0}' was not found. The settings can not be loaded.
es: No se encuentra el proveedor de configuración '{0}'. No se puede cargar la configuración.

# TestCaseFilterFormatException
source: Incorrect format for TestCaseFilter {0}. Specify the correct format and try again. Note that the incorrect format can lead to no test getting executed.
es: Formato incorrecto de TestCaseFilter {0}. Especifique el formato correcto y vuelva a intentarlo. Tenga en cuenta que un formato incorrecto puede dar lugar a que no se ejecute ninguna prueba.

# DataCollectorInitializationError
source: Data collector '{0}' threw an exception during type loading, construction, or initialization: {1}.
es: El recopilador de datos "{0}" produjo una excepción durante la carga, creación o inicialización del tipo: {1}.

# DataCollectorNotFound
source: Could not find data collector '{0}'
es: No se pudo encontrar el recopilador de datos "{0}"

# DataCollectorRequestedDuplicateEnvironmentVariable
source: The data collector '{0}' requested environment variable '{1}' with value '{2}' to be set in test execution environment, but another data collector '{3}' has already requested same environment variable with different value '{4}'.
es: El recopilador de datos "{0}" solicitó que la variable de entorno "{1}" con el valor "{2}" se estableciera en el entorno de ejecución de pruebas, pero otro recopilador de datos "{3}" ya ha solicitado la misma variable de entorno con otro valor "{4}".

# IgnoredDuplicateConfiguration
source: There are multiple configurations that have data collector FriendlyName as '{0}'. Duplicate configurations will be ignored in the test run.
es: Hay varias configuraciones que tienen el nombre descriptivo del recopilador de datos "{0}". Se omitirán las configuraciones duplicadas en la serie de pruebas.

# ReportDataCollectorException
source: Data collector caught an exception of type '{0}': '{1}'. More details: {2}.
es: El recopilador de datos detectó una excepción de tipo "{0}": "{1}". Más detalles: {2}.

# WrongDataCollectionContextType
source: Types deriving from the data collection context cannot be used for sending data and messages. The DataCollectionContext used for sending data and messages must come from one of the events raised to the data collector.
es: Los tipos derivados del contexto de recolección de datos no se pueden usar para enviar datos y mensajes. El elemento DataCollectionContext usado para enviar datos y mensajes debe proceder de alguno de los eventos generados para el recolector de datos.

# LoggerUriInvalid
source: The Test Logger URI '{0}' is not valid. The Test Logger will be ignored.
es: El URI de registrador de pruebas '{0}' no es válido. Se omitirá el registrador de pruebas.
